import * as Yup from "yup";

export const signupValidationRules = {
    name: Yup.string()
    .required("خانة الإسم مطلوبه")
    .min(5, "الإسم يجب ان يكون 5 حروف او أكثر"),
    email: Yup.string()
    .required("خانة البريد الإلكتروني مطلوبه")
    .email("البريد الإلكتروني غير مناسب")
    .matches(
      /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/
    ,'البريد الإلكتروني غير مناسب'),
    phoneNumber: Yup.string()
    .required("خانة الرقم مطلوبه")
    .matches(/^\d+$/, 'رقم الهاتف يجب الا يحتوي علي حروف او رموز خاصه')
    .min(5, "رقم الهاتف يجب ان يكون 5 أرقام او أكثر")
    .typeError("رقم الهاتف غير مناسب"),
    password: Yup.string()
    .required("خانة كلمة المرور مطلوبه")
    .min(5, "كلمة المرور يجب ان تكون 5 حروف او أكثر"),
  }